//시계를 화면의 가운데다가 놓을 것이다.
//유저가 자기 이름을 입력하면 끝까지 기억하게 만든다. + 이름을 고칠 수 있게 하는 기능도 가능하면 추가
//ToDo리스트를 시계 아래다가 만든다.
//배경화면이 랜덤한 이미지로 랜덤한 순서로 바뀔 수 있게 한다.
//지역의 날씨를 알려주는 기능도 넣는다.


//시계를 보여주는 함수
function showClock(){}

//유저의 이름을 받는 함수 : 이름을 인풋으로 받고 & 저장 & 화면에 보여주기 & 원하면 이름을 삭제했다가 바꿀 수 있도록
function getUserName(){}

//ToDo리스트를 만들 수 있는 함수. : 항목을 인풋으로 받고 & 리스트를 생성->항목을 리스트에 담고 & 저장 & 화면에 보여주기 & 삭제
function makeToDoList(){}

//랜덤한 이미지를 랜덤한 순서로 화면에 띄우는 함수 : 이미지들의 array를 만들고 & 랜덤한 순서로 화면에 보여준다.
function rdmBackGroundImg(){}

//날씨 보여주는 함수.
function getWeatherByLocation(){}